; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v13 ?v9)
             (pred_2 ?v2 ?v3)
             (pred_6 ?v13 ?v3)
             (pred_9 ?v12 ?v13 )
	     (pred_11 ?v13)
             (pred_10 ?v1)
             (pred_8 ?v2)
             (pred_12 ?v3)
             (pred_3 ?v13)
             (pred_1 ?v2)
             (pred_5 ?v13)
             (pred_4 ))



(:action op_5
:parameters (?v10 ?v11 ?v4 ?v6)
:precondition (and (pred_10 ?v10) (pred_10 ?v11) (pred_8 ?v4) (pred_12 ?v6)
          (pred_7 ?v10 ?v11) (pred_2 ?v4 ?v6)
                   (pred_6 ?v11 ?v6) (pred_11 ?v10) 
                   (pred_3 ?v11) (pred_1 ?v4))
:effect (and  (pred_5 ?v11) (not (pred_3 ?v11))))


(:action op_2
:parameters (?v10 ?v5)
:precondition (and (pred_10 ?v10) (pred_10 ?v5)
               (pred_11 ?v10) (pred_7 ?v10 ?v5) (pred_5 ?v5))
:effect (and (pred_11 ?v5) (not (pred_11 ?v10))))

(:action op_1
:parameters (?v10 ?v4)
:precondition (and (pred_10 ?v10) (pred_8 ?v4) 
                  (pred_11 ?v10) (pred_9 ?v4 ?v10) (pred_4 ))
:effect (and (pred_1 ?v4)
   (not (pred_9 ?v4 ?v10)) (not (pred_4 ))))


(:action op_3
:parameters (?v10 ?v7 ?v8)
:precondition (and (pred_10 ?v10) (pred_8 ?v7) (pred_8 ?v8)
                  (pred_11 ?v10) (pred_1 ?v8) (pred_9 ?v7 ?v10))
:effect (and (pred_1 ?v7) (pred_9 ?v8 ?v10)
        (not (pred_1 ?v8)) (not (pred_9 ?v7 ?v10))))

(:action op_4
:parameters (?v10 ?v4)
:precondition (and (pred_10 ?v10) (pred_8 ?v4) 
                  (pred_11 ?v10) (pred_1 ?v4))
:effect (and (pred_4 ) (pred_9 ?v4 ?v10) (not (pred_1 ?v4)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_10 obj_08 obj_04 obj_09 obj_07 obj_12 obj_06 obj_02
    obj_03 obj_01
    obj_05 obj_13
    )

    (:init
       (pred_4)

       (pred_10 obj_11)
       (pred_10 obj_10)
       (pred_10 obj_08)
       (pred_10 obj_04)
       (pred_10 obj_09)
       (pred_10 obj_07)
       (pred_10 obj_12)
       (pred_10 obj_06)
       (pred_10 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_01)
       (pred_8 obj_05)
       (pred_8 obj_13)

       (pred_7 obj_11 obj_04)
       (pred_7 obj_11 obj_10)
       (pred_7 obj_10 obj_09)
       (pred_7 obj_10 obj_08)
       (pred_7 obj_10 obj_11)
       (pred_7 obj_08 obj_07)
       (pred_7 obj_08 obj_10)
       (pred_7 obj_04 obj_12)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_11)
       (pred_7 obj_09 obj_06)
       (pred_7 obj_09 obj_07)
       (pred_7 obj_09 obj_10)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_07 obj_02)
       (pred_7 obj_07 obj_08)
       (pred_7 obj_07 obj_09)
       (pred_7 obj_12 obj_06)
       (pred_7 obj_12 obj_04)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_06 obj_09)
       (pred_7 obj_06 obj_12)
       (pred_7 obj_02 obj_07)
       (pred_7 obj_02 obj_06)
       (pred_3 obj_04)
       (pred_3 obj_11)
       (pred_6  obj_04 obj_03)
       (pred_6  obj_11 obj_01)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_09)
       (pred_5 obj_07)
       (pred_5 obj_12)
       (pred_5 obj_06)
       (pred_5 obj_02)

       (pred_2  obj_05 obj_03)
       (pred_2  obj_13 obj_01)
       (pred_9 obj_05 obj_08)
       (pred_9 obj_13 obj_09)
       (pred_11 obj_08)
    )

    (:goal (and
       (pred_9 obj_05 obj_02)
       (pred_9 obj_13 obj_08)
    ))
(:constraints
  (always (not (pred_11 obj_07)))
)
)

; plan
1. (op_1 obj_08 obj_05)
   deleted: (pred_9 obj_05 obj_08) (pred_4)
   added: (pred_1 obj_05)
   goals met: 0 of 2
2. (op_2 obj_08 obj_10)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_10)
   goals met: 0 of 2
3. (op_2 obj_10 obj_09)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_09)
   goals met: 0 of 2
4. (op_3 obj_09 obj_13 obj_05)
   deleted: (pred_1 obj_05) (pred_9 obj_13 obj_09)
   added: (pred_1 obj_13) (pred_9 obj_05 obj_09)
   goals met: 0 of 2
5. (op_2 obj_09 obj_10)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_10)
   goals met: 0 of 2
6. (op_2 obj_10 obj_08)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_08)
   goals met: 0 of 2
7. (op_4 obj_08 obj_13)
   deleted: (pred_1 obj_13)
   added: (pred_4) (pred_9 obj_13 obj_08)
   goals met: 1 of 2
8. (op_2 obj_08 obj_10)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_10)
   goals met: 1 of 2
9. (op_2 obj_10 obj_09)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_09)
   goals met: 1 of 2
10. (op_1 obj_09 obj_05)
   deleted: (pred_9 obj_05 obj_09) (pred_4)
   added: (pred_1 obj_05)
   goals met: 1 of 2
11. (op_2 obj_09 obj_06)
   deleted: (pred_11 obj_09)
   added: (pred_11 obj_06)
   goals met: 1 of 2
12. (op_2 obj_06 obj_02)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_02)
   goals met: 1 of 2
13. (op_4 obj_02 obj_05)
   deleted: (pred_1 obj_05)
   added: (pred_4) (pred_9 obj_05 obj_02)
   goals met: 2 of 2
